---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetHostedInfo
source: html/e11c4774-dc2e-0b85-5511-503d8aabf764.htm
---
# Autodesk.Revit.DB.FabricationPart.GetHostedInfo Method

Gets the fabrication hosted element information.

## Syntax (C#)
```csharp
public FabricationHostedInfo GetHostedInfo()
```

## Returns
The fabrication hosted element information. Returns null if the fabrication part does not have a host.